{
    "course-info": {
        "course-head-title": "Learn HTML",
        "course-head-description": "The language used to build the structure of websites. Learn how to add text, images, links and more to your website.",
        "course-duration": "-",
        "course-difficulty": "Easy",
        "bg-color": "#fff2db",
        "btn-color": "orangered"
    },
    "course-chapters": {
        "chapter-1": {
            "chapter-title": "Introduction to HTML",
            "chapter-description": "HTML (Hypertext Markup Language) is a markup language used to create web pages that are served by web servers and displayed by web clients, such as web browsers. It defines the structure and content of a web page using tags and attributes, which are interpreted by web browsers to display text, images, links, and other multimedia content. HTML is a key component of the World Wide Web and is used in conjunction with other technologies, such as CSS and JavaScript, to create dynamic and interactive web pages.",
            "chapter-paragraph-headings": ["What is a web server?", "What is a web client?"],
            "chapter-paragraphs": [
                "Every website needs a server to run on. A web server is a computer that is connected to the internet and is running a web server software. The web server listens for incoming requests from web browsers, retrieves the requested resources, and sends them back to the client over the internet. Web servers typically use HTTP (Hypertext Transfer Protocol) as the primary communication protocol to transfer data between the server and client.",
                "A web client is a software or application that requests and displays web content from a web server. It communicates with the web server using HTTP and sends requests for web pages or resources such as images, videos, or scripts. The most common web client is a web browser, such as Google Chrome, Firefox, or Safari, but web clients can also be other software programs or applications that communicate with web servers to retrieve and display web content."
            ],
            "chapter-paragraph-images": ["assets/courses/html/web-server.png" , "assets/courses/html/web-client.png"],
            "chapter-paragraph-code-examples": [],
            "chapter-tasks": ["What does HTTP stand for?", "Where does a website run on?", "What is the most common web client?"],
            "chapter-task-input-types": ["text", "text", "text"],
            "chapter-task-prefills": ["", "", ""],
            "chapter-task-answers": ["hypertext transfer protocol", "web server", "web browser"],
            "chapter-task-hints": []
        },
        "chapter-2": {
            "chapter-title": "Creating a basic HTML document",
            "chapter-description": "For a website you need to create a document with the .html extension. This document will contain all the HTML code for your website. The main document is usually called <code>index.html</code>. You can create this document in any text editor or IDE (e.g. Notepad, Sublime Text, Visual Studio Code, WebStorm, etc.).",
            "chapter-paragraph-headings": ["Inside the document", "", ""],
            "chapter-paragraphs": ["Since HTML 5, every html file should start with <code>&lt;!DOCTYPE html&gt;</code>. This tells the browser to expect an html document. After that the <code>&lt;html&gt;</code> tag follows. This tag tells the browser that the content inside is HTML code. Inside the <code>&lt;html&gt;</code> tag you will find the <code>&lt;head&gt;</code> and <code>&lt;body&gt;</code> tags. While the <code>&lt;head&gt;</code> tag contains information about the document, such as the title of the document the <code>&lt;body&gt;</code> tag contains the content of the document, such as text, images, links, etc.",
                "<b>IMPORTANT:</b> Almost every opening tag should have a closing tag. For example, <code>&lt;html&gt;</code> has the closing tag <code>&lt;/html&gt;</code>.",
                "Here is an example of a basic HTML document:"],
            "chapter-paragraph-images": [],
            "chapter-paragraph-code-examples": ["", "", "assets/courses/html/code-snippets/HTMLDoc.html"],
            "chapter-tasks": ["What's the closing tag for a <code>&lt;p&gt;</code> element?", "Use the editor below to create a basic html document containing a title and a h1 heading"],
            "chapter-task-input-types": ["text", "code"],
            "chapter-task-prefills": ["", "<!DOCTYPE html>"],
            "chapter-task-answers": ["", "</p>"],
            "chapter-task-hints": []
        },
        "chapter-3": {
            "chapter-title": "HTML Elements",
            "chapter-description": "HTML elements are the building blocks of HTML pages. With HTML elements you can define the structure of your website. HTML elements are defined by tags. A tag is a keyword surrounded by angle brackets, like <code>&lt;html&gt;</code>.",
            "chapter-paragraph-headings": ["HTML Tags", "HTML Attributes"],
            "chapter-paragraphs": [
                "HTML tags are used to define HTML elements. An HTML element consists of a starting tag, content, and an ending tag. The HTML element is everything from the start tag to the end tag: <code>&lt;h1&gt;My First Heading&lt;/h1&gt;</code>. The content of an HTML element is the information between its start tag and end tag. For example, <code>My First Heading</code> is the content of the <code>&lt;h1&gt;</code> element.",
                "HTML attributes provide additional information about HTML elements. Attributes are always specified in the start tag. Attributes usually come in name/value pairs like: <code>name=\"value\"</code>. For example, the <code>&lt;a&gt;</code> tag defines a hyperlink. The href attribute specifies the URL of the page the link goes to: <code>&lt;a href=\"https://www.google.com\"&gt;Google&lt;/a&gt;</code>."
            ],
            "chapter-paragraph-images": [],
            "chapter-paragraph-code-examples": [],
            "chapter-tasks": ["What is the content of this element: <code>&lt;h1&gt;Hello&lt;/h1&gt;</code>", "What is the attribute of this element: <code>&lt;a href=\"https://www.google.com\"&gt;Google&lt;/a&gt;</code>"],
            "chapter-task-input-types": ["text", "text"],
            "chapter-task-prefills": ["", ""],
            "chapter-task-answers": ["Hello", "href"],
            "chapter-task-hints": []
        },
        "chapter-4": {
            "chapter-title": "Classes and IDs",
            "chapter-description": "Classes and IDs are attributes that can be added to HTML elements to style them using CSS. Class- and Id-names are case-sensitive, cannot start with a number, cannot contain spaces and can only include alphanumeric characters and underscores.",
            "chapter-paragraph-headings": ["Usage"],
            "chapter-paragraphs": [
                "Classes and IDs can be used on any HTML element. In CSS classes are selected with a dot in front of the class name: <code>.my-class</code>. In HTML they are added to an element with the class attribute: <code>&lt;div class=\"my-class\"&gt;&lt;/div&gt;</code>. While classes can be used multiple times on the same page, IDs can only be used once. In CSS they are selected with a hash in front of the ID name: <code>#my-id</code>. In HTML they are added to an element with the id attribute: <code>&lt;div id=\"my-id\"&gt;&lt;/div&gt;</code>."
            ],
            "chapter-paragraph-images": [],
            "chapter-paragraph-code-examples": ["assets/courses/html/code-snippets/ClassIdExample.html"],
            "chapter-tasks": ["Add a class called <code>my-class</code> to the <code>&lt;h1&gt;</code> element.", "Add an id called <code>my-id</code> to the <code>&lt;h1&gt;</code> element."],
            "chapter-task-input-types": ["code", "code"],
            "chapter-task-prefills": ["<h1>Heading with a class</h1>", "<h1>Heading with an id</h1>"],
            "chapter-task-answers": ["", ""],
            "chapter-task-hints": []
        }
    }
}